'''
1. Создать свой репозиторий на GitHub
2. Сделать несколько коммитов на репозиторий (коммитить можно домашки)
3. Создать на репозитории файл Readme.md
'''
print("Hello GitHUB!")